In [1]:
import pandas as pd
import numpy as np

# 5.1 Introduction to pandas Data Structures

### Series

In [51]:
obj = pd.Series([4, 7, -5, 3])

In [52]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

And so on...

Assigning an index to a series:

In [53]:
obj2 = pd.Series([4, 7, -5, 3], index = ['a', 'b', 'c', 'd'])

In [54]:
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [55]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [56]:
obj2[['c', 'a', 'd']]

c   -5
a    4
d    3
dtype: int64

In [57]:
obj2[obj2 > 2]

a    4
b    7
d    3
dtype: int64

In [58]:
'b' in obj2

True

In [59]:
sdata = sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [60]:
#dict keys are auto-assigned to indexes. we can manually set index values.

states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [61]:
#to find null values in series  (can also use pd.notnull() for opposite boolean)

pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [62]:
obj3 + obj4 #adds values of columns together by matching indexes.

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [63]:
#setting properties of a series
obj4.name = 'population'
obj4.index.name = 'State'
obj4

State
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [64]:
# can also update things like index name in-line
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

# DataFrames

### Most common way to form a dataframe is by using a dict.

In [65]:
  data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
            'year': [2000, 2001, 2002, 2001, 2002, 2003],
            'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [66]:
frame.head() #shows first 5 items in a df.

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [67]:
# if a column is set that doesn't have matching values, the default will be None

frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                     index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [68]:
# data in a column can be retreived as a series or like we're calling the key from a Python dict

frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [69]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [70]:
# rows are retrieved using .loc & .iloc

frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [71]:
# columns can be modified all at once if needed (either w/ a single, scalar, value. or an array)

frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [72]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [73]:
# assigning a series to values in a column either goes in order (if no index is given) or fills in for matching indexes
#in the series.

val = pd.Series([-1.2, -1.5, -1.7], index=['two','four','five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [74]:
# assigning a column that doesn't exist will make a new column
# below we set column eastern to a boolean checking whether the state is Ohio or not

frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [75]:
# del method deletes columns

del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [76]:
# nested dict of dicts is also useful for dataframes. The outer keys become columns, inner keys become indices.

pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 3.6}}
frame3 = pd.DataFrame(pop)

frame3

      Nevada  Ohio
2001     2.4   3.6
2002     2.9   NaN
2000     NaN   1.5

In [77]:
# dataframes can be 'transposed' to numpy arrays, swapping layout of columns & rows

frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     3.6   NaN   1.5

In [78]:
#dataframe constructors come in many varieties.

pdata = {'Ohio': frame3['Ohio'][:-1],
                'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   3.6     2.4
2002   NaN     2.9

In [79]:
# similar dict functions are also available to dataframes.

frame3.values

array([[2.4, 3.6],
       [2.9, nan],
       [nan, 1.5]])

In [80]:
# index objects are immutable. 
obj = pd.Series(range(3), index=['a','b','c'])
index = obj.index
index[1] = 'd'

# we cannot reassign the index value, being immutable, it becomes safer to share these values between tables.

TypeError: Index does not support mutable operations

In [82]:
labels = pd.Index(np.arange(3))
labels
#index object

Int64Index([0, 1, 2], dtype='int64')

In [83]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [85]:
# labels & obj2.index are the same object. 

obj2.index is labels

True

In [86]:
# Indexes also behave like fix-sized sets:

frame3.columns

Index(['Nevada', 'Ohio'], dtype='object')

In [87]:
# but unlike python, pandas Indexes can have duplicates

dup_labels = pd.Index(['foo','foo', 'bar', 'bar'])
# index object / like a set

# but duplicates are allowed. if selected the index w/ duplicates, all instances of that index will be selected
# i.e. pretened_dup_labels_df['foo'] would return both rows with index 'foo'
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [88]:
# Reindexing; create a new object w/ data 'conformed' to a new index.

#our starting series
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [89]:
# once we have a data object we can call 'reindex' on it and save it to a new object (reindex returns an object)

obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [93]:
# ffill can be used to fill in missing indexes

obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [95]:
# using ffill, but it does not alter the object in place.

obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [100]:
# DataFrame reindex can alter index, columns, or both

frame = pd.DataFrame(np.arange(9).reshape((3, 3)), 
                    index=['a','c', 'd'], columns=['Ohio', 'Texas', 'California'])

frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [101]:
# now for the reindex

frame2 = frame.reindex(['a','b','c','d'])
frame2


#we had indices a, c, & d. we still don't have values for 'b' but we now have a corresponding row.

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [104]:
# to reindex columns, we use the columns keyword

states = ['Texas', 'Utah', 'California']

frame99 = frame.reindex(columns=states)
frame99

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [110]:
# you can also use .loc for reindexing columns

# will need some time with this one, syntax as shown in book may not be correct
frame.loc[['a', 'b', 'c', 'd'], states]

KeyError: "['b'] not in index"

In [111]:
# Dropping entries from an axis (axis=0 is rows, axis=1 is columns)

obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [113]:
#now for the drop, returns a series without changing the original.

new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [116]:
obj.drop(['a','d'])

b    1.0
c    2.0
e    4.0
dtype: float64

In [117]:
# let's see how to drop data from either axis

data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one','two','three','four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [118]:
#calling drop w/ labels will drop values from row (axis 0)

data.drop(['Ohio', 'Colorado'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [119]:
# dropping a column is similar, just set axis = 1

data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [120]:
# you can accomplish the same thing by setting axis='columns', just two ways to phrase the same thing

data.drop(['two', 'three'], axis='columns')

          one  four
Ohio        0     3
Colorado    4     7
Utah        8    11
New York   12    15

In [121]:
# for now we've been returning a new data object. Another thing we can do is modify the dataframe inplace.

obj.drop('c', inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

# Indexing, Selecting & Filtering

In [122]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [123]:
obj['b'] #same as getting a value from a dict.

1.0

In [124]:
obj[1]

1.0

In [126]:
obj[2:4] # slicing also works

c    2.0
d    3.0
dtype: float64

In [128]:
# want the data in a different order? no problem

obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [129]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [131]:
obj[obj < 2] #let's get rows where the value is < 2

a    0.0
b    1.0
dtype: float64

In [132]:
#unlike python, slicing is endpoint inclusive

obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [133]:
#values can even updated by calling rows like this

obj['b': 'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [134]:
# ch-ch-ch-ch-cheat cooode

obj[obj < 6] = 99
obj

a    99.0
b    99.0
c    99.0
d    99.0
dtype: float64

In [135]:
# the above really wasn't necessary

In [137]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [138]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [140]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [141]:
data[:2] #back to slicing rows

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [142]:
data[data['three'] > 5] #returns a table with rows where the value in 'three' column is > 5

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [143]:
# if we want to see which rows would be changed ahead of time before using the above example we could return
# a boolean table

data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [144]:
data[data < 5] = 0 #reverse ch-ch-ch-cheat cooode ;_;
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [146]:
# selecting rows/columsn with loc & iloc

data.loc['Colorado', ['two', 'three']] # from 'Colorado' index, returns columsn 'two' and 'three'

two      5
three    6
Name: Colorado, dtype: int64

In [147]:
# same can be done with using integer values of locations
data.iloc[1, [1, 2]]

two      5
three    6
Name: Colorado, dtype: int64

In [148]:
# let's see that sweet sweet Utah data

data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [149]:
# lists for everyone! return multiple rows & columns.. in whatever order we want!!!! It's madness!

data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [151]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

# Integer Indexes

In [152]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [154]:
ser[-1] #this gets confusing, sticking to non-integer indices is good practice due to 
# the nature of using index #s for accessing parts of data sets.

KeyError: -1

In [155]:
# loc for labels, iloc for integers when selecting indexes

ser[:1]

0    0.0
dtype: float64

# Arithmetic and Data Alignment

When adding _objects_ together, the index pairs should match. When they don't there are unintended interactions ( shown below ).

In [156]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
                       index=['a', 'c', 'e', 'f', 'g'])

In [157]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [158]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [159]:
# for the weirdness, let's add them together. Remember all the non-matching index pairs.

s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

##To avoid this we use data alignment

In [161]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'),
                  index=['Ohio', 'Texas', 'Colorado'])

df2 = pd.DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
                  index =['Utah','Ohio','Texas','Oregan'])

# now we can add these two together, despite non-matching indexes.
# this is like a union in SQL. The above is like an unintended outer-join in SQL.

df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregan    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

## Arithmetic Methods with Fill Values

In [162]:
# if one data set has a value where the other has None, we can pass in a default value 
# for the null values.

df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),
                  columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),
                  columns=list('abcde'))

df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [163]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [164]:
# adding together without default values will result in NaNs


df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [165]:
# with the .add() method we can set a fill_value

df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [166]:
# fill_values can also be set when reindexing

df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

## Other arithmetic operations in pandas:

1. radd
2. rsub
3. rdiv
4. rfloordiv
5. rmul
6. rpow

In [ ]:
# arithmetic between dataframes & series:

In [167]:
arr = np.arange(12.).reshape((3,4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [168]:
arr[0]

array([0., 1., 2., 3.])

In [169]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [170]:
# subtracting arr[0] reduced each row of the array by the values specified in arr[0].
# subtraction was performed once for each row.
# operations between dataframes & series are similar

In [174]:
frame = pd.DataFrame(np.arange(12.).reshape((4,3)),
                    columns=list('bde'),
                    index=['Utah','Ohio','Texas','Oregon'])

series = frame.loc['Utah'] # could also write series = frame.iloc[0]

frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [175]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [176]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [177]:
# If an index value is not found in either the DataFrame’s columns or the Series’s index, the objects will be reindexed to form the union:
#     In [184]: series2 = pd.Series(range(3), index=['b', 'e', 'f'])
#     In [185]: frame + series2
#     Out[185]:
# bdef Utah 0.0 NaN 3.0 NaN Ohio 3.0 NaN 6.0 NaN Texas 6.0NaN 9.0NaN Oregon 9.0 NaN 12.0 NaN

In [179]:
# to perform arithmetic on columsn, rather than rows we use a different process

series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [180]:
# here we use the dataframe .sub() method. series3 holds our values, axis='index' sets the 
# orientation
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [185]:
frame.sub(series3, axis=1) #... yeah, don't try the rows with this that's quite the wacky
# union, considering we added our indices to the columns

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

# Function Application and Mapping

NumPy unfuncs (element-wise array methods) also work with pandas objects:

In [186]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                    index=['Utah','Ohio','Texas','Oregon'])

frame

               b         d         e
Utah   -0.506483 -0.439562 -0.692071
Ohio    0.079943 -0.749424 -0.490484
Texas   1.718093 -0.056217  1.080724
Oregon  1.213023 -1.183283 -0.027774

In [187]:
# absolute value, courtesy of NumPy

np.abs(frame)

               b         d         e
Utah    0.506483  0.439562  0.692071
Ohio    0.079943  0.749424  0.490484
Texas   1.718093  0.056217  1.080724
Oregon  1.213023  1.183283  0.027774

In [188]:
# we can also applly a function to each column or row.
# this one takes the highest value in each column, subtracts it by the lowest,
# and returns the value per column.

f = lambda x: x.max() - x.min()
frame.apply(f)

b    2.224576
d    1.127066
e    1.772795
dtype: float64

In [189]:
# to do the same thing but based on columns

frame.apply(f, axis='columns')

Utah      0.252509
Ohio      0.829367
Texas     1.774309
Oregon    2.396306
dtype: float64

In [190]:
# the function passed to apply doesn't have to return single, scalar, values.
# the function can also return series

def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

frame.apply(f)

            b         d         e
min -0.506483 -1.183283 -0.692071
max  1.718093 -0.056217  1.080724

In [191]:
format = lambda x: '%.2f' % x

frame.applymap(format)

            b      d      e
Utah    -0.51  -0.44  -0.69
Ohio     0.08  -0.75  -0.49
Texas    1.72  -0.06   1.08
Oregon   1.21  -1.18  -0.03

In [192]:
frame['e'].map(format)

Utah      -0.69
Ohio      -0.49
Texas      1.08
Oregon    -0.03
Name: e, dtype: object

# Sorting and Ranking (pg 153)

In [3]:
# data can be sorted by different criterion.
# lexicographical sorting can be done by rows or column index w/ sort_index
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [4]:
# with a dataframe, data can be sorted by either rows or columns
frame = pd.DataFrame(np.arange(8).reshape((2,4)),
                    index=['three','one'],
                    columns=['d', 'a', 'b','c'])

frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [5]:
#now by column

frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [6]:
# why not both?
frame.sort_index().sort_index(axis=1)

       a  b  c  d
one    5  6  7  4
three  1  2  3  0

In [8]:
# reverse it!

frame.sort_index(ascending=False).sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [9]:
# we won't stop there, with your order of a series
# you can also sort by VALUES! Yes, values!
# (missing values go to the back by default)

obj.sort_values()

d    0
a    1
b    2
c    3
dtype: int64

In [12]:
# or pick a column to sort by in the dataframe!
frame.sort_values('a').sort_index(axis='columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [13]:
#can also choose multiple columns to sort by

frame.sort_values(['a', 'b'])

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [16]:
# time for rankings, it's like college football but it's code
# on a macbook
# in the middle of summer

obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [17]:
# rankings methods .rank()

obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [18]:
# can also rank by what shows up first in the data
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [19]:
# rankings also apply to dataframes
# pandas will judge EVERYTHING. Don't be found lacking.

frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [20]:
# rank for the values in each row, with the columns taking each rank

frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

Method Description

**'average'** Default: assign the average rank to each entry in the equal group

**'min'** Use the minimum rank for the whole group

**'max'** Use the maximum rank for the whole group

**'first'** Assign ranks in the order the values appear in the data

**'dense'** Like method='min', but ranks always increase by 1 in between groups rather than the number of equal elements in a group

In [21]:
# rankings when axis indexes have the same label

obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

# we can check if the values are unique before doing rankings

obj.index.is_unique

False

In [22]:
obj.rank()

a    1.0
a    2.0
b    3.0
b    4.0
c    5.0
dtype: float64

# Summarizing and Computing Descriptive Statistics

In [3]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
                 index=['a', 'b', 'c', 'd'],
                 columns=['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [4]:
#sum by columns
df.sum()

one    9.25
two   -5.80
dtype: float64

In [5]:
#sum by row
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [6]:
# we can skip null vales w/ skipna. skipna is set True by default.
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [7]:
# some methods return index values. like idxmin & idxmax (index min / max)

df.idxmax()

one    b
two    d
dtype: object

In [8]:
# other methods are accumulations

df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [9]:
# the describe method describes a bunch of statistical methods / calculations at once

df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [10]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

# pg 160 for more methods

# Correlation and Covariance

In [13]:
import sys
!{sys.executable} -m pip install pandas-datareader

Collecting pandas-datareader
  Downloading pandas_datareader-0.10.0-py3-none-any.whl (109 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 109.5/109.5 KB 5.1 MB/s eta 0:00:00
Requirement already satisfied: pandas>=0.23 in /opt/homebrew/Cellar/jupyterlab/3.4.3/libexec/lib/python3.10/site-packages (from pandas-datareader) (1.4.3)
Requirement already satisfied: requests>=2.19.0 in /opt/homebrew/Cellar/jupyterlab/3.4.3/libexec/lib/python3.10/site-packages (from pandas-datareader) (2.28.0)
Collecting lxml
  Downloading lxml-4.9.1.tar.gz (3.4 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3.4/3.4 MB 11.5 MB/s eta 0:00:0000:0100:01
  Preparing metadata (setup.py) ... done
Requirement already satisfied: numpy>=1.21.0 in /opt/homebrew/Cellar/jupyterlab/3.4.3/libexec/lib/python3.10/site-packages (from pandas>=0.23->pandas-datareader) (1.23.1)
Requirement already satisfied: pytz>=2020.1 in /opt/homebrew/Cellar/jupyterlab/3.4.3/libexec/lib/python3.10/site-packages (from pandas>=0.23->pandas-datareader) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/homebrew/Cellar/jupyterlab/3.4.3/libexec/lib/python3.10/site-packages (from pandas>=0.23->pandas-datareader) (2.8.2)
Requirement already satisfied: idna<4,>=2.5 in /opt/homebrew/Cellar/jupyterlab/3.4.3/libexec/lib/python3.10/site-packages (from requests>=2.19.0->pandas-datareader) (3.3)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in /opt/homebrew/Cellar/jupyterlab/3.4.3/libexec/lib/python3.10/site-packages (from requests>=2.19.0->pandas-datareader) (1.26.9)
Requirement already satisfied: charset-normalizer~=2.0.0 in /opt/homebrew/Cellar/jupyterlab/3.4.3/libexec/lib/python3.10/site-packages (from requests>=2.19.0->pandas-datareader) (2.0.12)
Requirement already satisfied: certifi>=2017.4.17 in /opt/homebrew/Cellar/jupyterlab/3.4.3/libexec/lib/python3.10/site-packages (from requests>=2.19.0->pandas-datareader) (2022.6.15)
Requirement already satisfied: six>=1.5 in /opt/homebrew/Cellar/six/1.16.0_2/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas>=0.23->pandas-datareader) (1.16.0)
Building wheels for collected packages: lxml
  Building wheel for lxml (setup.py) ... done
  Created wheel for lxml: filename=lxml-4.9.1-cp310-cp310-macosx_12_0_arm64.whl size=1492420 sha256=e4253b52ba9fc74cfd4d42a98dc9059cdc6dbdbbcc8a966a6536b5fda271c9b2
  Stored in directory: /Users/nick/Library/Caches/pip/wheels/a4/ec/7b/8acde6da24b5aabeee049213d5bec12d1e9214d3cae276387b
Successfully built lxml
Installing collected packages: lxml, pandas-datareader
Successfully installed lxml-4.9.1 pandas-datareader-0.10.0
WARNING: You are using pip version 22.0.4; however, version 22.2 is available.
You should consider upgrading via the '/opt/homebrew/Cellar/jupyterlab/3.4.3/libexec/bin/python3.10 -m pip install --upgrade pip' command.

In [17]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
           for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
for ticker, data in all_data.items()})

In [18]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2022-07-20  0.013510 -0.012989  0.010558  0.000698
2022-07-21  0.015094 -0.015714  0.009799  0.002964
2022-07-22 -0.008111  0.008651 -0.016916 -0.058067
2022-07-25 -0.007398  0.002261 -0.005876 -0.001384
2022-07-26 -0.007715 -0.001089 -0.032705 -0.023196

In [20]:
# corr method computers the correlation of overlapping, non-null, index aligned values in two series
# for this example we can compare two tickers

returns['MSFT'].corr(returns['IBM'])

0.4773905471429206

In [21]:
# cov calculates covariance

returns['MSFT'].cov(returns['IBM'])

0.00015209453886053147

In [22]:
# and coor for correlation

returns.MSFT.corr(returns.IBM)

0.4773905471429206

In [23]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.432588  0.756668  0.682409
IBM   0.432588  1.000000  0.477391  0.444544
MSFT  0.756668  0.477391  1.000000  0.784498
GOOG  0.682409  0.444544  0.784498  1.000000

In [24]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000410  0.000150  0.000285  0.000256
IBM   0.000150  0.000294  0.000152  0.000141
MSFT  0.000285  0.000152  0.000345  0.000271
GOOG  0.000256  0.000141  0.000271  0.000344

In [25]:
# check other column's correlation w/ a specific column

returns.corrwith(returns.IBM)

AAPL    0.432588
IBM     1.000000
MSFT    0.477391
GOOG    0.444544
dtype: float64

In [26]:
# let's tie in the volume dataframe we made earlier. what did the price action due compared to volume traded?

returns.corrwith(volume)

AAPL   -0.075011
IBM    -0.113686
MSFT   -0.070970
GOOG   -0.082832
dtype: float64

# Unique Values, Value Counts, and Membership

In [29]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

# well that's a lot of repeats. Let's look at it like a set

uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [34]:
# just how many times are some of those values repeated?!

obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [31]:
# it will even mow your lawn

obj.mow_lawn()

AttributeError: 'Series' object has no attribute 'mow_lawn'

In [38]:
# by default, value_counts() returns sorted by number of occurrenes. We can also sort by the values of each entry.

pd.value_counts(obj.values, sort=False)

c    3
a    3
d    1
b    2
dtype: int64

In [40]:
mask= obj.isin(['b', 'c'])

mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [41]:
#shows everything in the dataframe as a list of values?
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [42]:
# Related to isin method is the Index.get_indexer method. This method gives you an
# index array from an array of possibly non-distinct values.
# technical jargon doesn't beat practice

to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c','b','a'])

pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In [43]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                    'Qu2': [2, 3, 1, 2, 3],
                    'Qu3': [1, 5, 2, 4, 4]})

data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [44]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## fin